# pivot tables

In [1]:
import numpy as np 
import pandas as pd

In [3]:
data = {
    'Date': pd.date_range(start='2023-01-01', periods=20),
    'Product': ['A', 'B', 'C', 'D'] * 5,
    'Region': ['East', 'West', 'North', 'South'] * 5,
    'Sales': np.random.randint(100, 1000, 20),
    'Units': np.random.randint(10, 100, 20),
    'Rep': ['Jhon', 'Mary', 'Bob', 'Alice'] * 5,
}

df = pd.DataFrame(data)
df['Month'] = df['Date'].dt.month_name()
df['Quarter'] = 'Q' + df['Date'].dt.quarter.astype(str)
df

         Date Product Region  Sales  Units    Rep    Month Quarter
0  2023-01-01       A   East    497     24   Jhon  January      Q1
1  2023-01-02       B   West    922     26   Mary  January      Q1
2  2023-01-03       C  North    541     22    Bob  January      Q1
3  2023-01-04       D  South    798     20  Alice  January      Q1
4  2023-01-05       A   East    831     17   Jhon  January      Q1
5  2023-01-06       B   West    994     83   Mary  January      Q1
6  2023-01-07       C  North    354     16    Bob  January      Q1
7  2023-01-08       D  South    552     52  Alice  January      Q1
8  2023-01-09       A   East    706     77   Jhon  January      Q1
9  2023-01-10       B   West    234     54   Mary  January      Q1
10 2023-01-11       C  North    334     47    Bob  January      Q1
11 2023-01-12       D  South    312     99  Alice  January      Q1
12 2023-01-13       A   East    936     30   Jhon  January      Q1
13 2023-01-14       B   West    334     27   Mary  January      Q1
14 2023-01-15       C  North    914     50    Bob  January      Q1
15 2023-01-16       D  South    841     92  Alice  January      Q1
16 2023-01-17       A   East    933     75   Jhon  January      Q1
17 2023-01-18       B   West    330     91   Mary  January      Q1
18 2023-01-19       C  North    922     99    Bob  January      Q1
19 2023-01-20       D  South    796     79  Alice  January      Q1

In [8]:
pd.pivot_table(df, values='Sales', index='Region', columns='Product', aggfunc = 'sum')

Product       A       B       C       D
Region
East     3903.0     NaN     NaN     NaN
North       NaN     NaN  3065.0     NaN
South       NaN     NaN     NaN  3299.0
West        NaN  2814.0     NaN     NaN

In [ ]:
pivot2 = pd.pivot_table(df, values=['Sales', 'Units'], index='Region', columns='Product') # values mush be numeric
pivot2

         Sales                      Units
Product      A      B      C      D     A     B     C     D
Region
East     780.6    NaN    NaN    NaN  44.6   NaN   NaN   NaN
North      NaN    NaN  613.0    NaN   NaN   NaN  46.8   NaN
South      NaN    NaN    NaN  659.8   NaN   NaN   NaN  68.4
West       NaN  562.8    NaN    NaN   NaN  56.2   NaN   NaN

# Cross Tabs

In [ ]:
pd.crosstab(df['Region'], df['Product']) # cross is like pivot table but only for counting

Product  A  B  C  D
Region
East     5  0  0  0
North    0  0  5  0
South    0  0  0  5
West     0  5  0  0